emacs-packages.org
#+TITLE: Emacs Packages
#+AUTHOR: Patrick Schanen
#+LANGUAGE: en
#+EMAIL: patrick.schanen@gmail.com
#+LINK_HOME: http://psnc.github.io 
#+OPTIONS: toc:2 
* EMACS PACKAGES
** I-SEARCH
*** Keys
- *Isearch*				| http://am.informatik.hs-mannheim.de/emacs/Incremental-Search.html#Incremental-Search
  - =C-s=				| forward search
  - =C-s C-r=				| backward search
  - =C-r=				| to switch to a backward search, leaving the search string unchanged.
  - =C-g=				| canceling the search
- *Repeat Isearch*			| http://am.informatik.hs-mannheim.de/emacs/Repeat-Isearch.html
  - =C-s C-s=				| forward serach | invokes incremental + search again
  - =C-r C-r=				| backward serach | invokes incremental + search again
- *Reuse earlier search strings*	| http://am.informatik.hs-mannheim.de/emacs/Repeat-Isearch.html#Repeat-Isearch
  - =M-p=				| previous
  - =M-n=				| next
  - =M-e=				| To edit the current search string in the minibuffer without replacing it with items from the search ring
- *list-matching-line*			| http://ergoemacs.org/emacs/elisp_list_matching_lines.html
  - =M-o s=				| It'll list all lines in the current file that matches a given text
- *Modified to*
  - =C-c b=				| backward search
  - =C-c f=				| forward serach
** ORG-MOD 
*** org
*** org-cliplink
*** org-autolist
*** org-board
*** org-ac
*** TOC-org
** EVIL
*** evil-opener
*** evil-mark-replace
*** evil-visualstar
*** evil-textobj-anyblock
*** evil-tutor
*** evil-args
*** evil-magit
** HELM
*** helm
*** helm-github-stars
** ACEJUMP
*** Keys
/AceJump-mode is a minor mode for Emacs, enabling fast/direct cursor movement in current view./ /https://www.emacswiki.org/emacs/AceJump/
- *Serach by Char.*
 - =C-c j= | Head Char. 
*** Articles
- Emacs: ace-Jump, Avy, vs Isearch http://emacsist.com/10199
- Emacs: isearch by Arrow Keys http://ergoemacs.org/emacs/emacs_isearch_by_arrow_keys.html
** ACE-WINDOW
*** Keys
- =C-c w= | ace-window 
** DIRED
*** dired-toggle-sudo
*** dired-quick-sort
** MARKDOWN
*** markdown-mode
** LATEX
*** auctex
** PANDOC
*** pandoc
*** pandoc-mode
** CVS
*** csv-mode
** GIT
*** gited
*** magit
*** gist
** HUGO
*** easy-hugo https://github.com/masasam/emacs-easy-hugo
/Emacs major mode for writing blogs made with hugo by markdown or org-mode or AsciiDoc or reStructuredText or mmark/ 
-
** TWITTER
*** twittering-mode
** SNIPPET
*** yasnippet
** THEMEN
*** solarized-theme
*** airline-themes
-----
** TO SORT
*** syndicate
*** scss-mode
*** undo-tree
*** neotree
*** diffview
