emacs-packages.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6bd5a76">1. EMACS PACKAGES</a>
<ul>
<li><a href="#org0085824">1.1. I-SEARCH</a></li>
<li><a href="#org8439b4a">1.2. ORG-MOD</a></li>
<li><a href="#orgf6c0fd8">1.3. EVIL</a></li>
<li><a href="#org83f60c8">1.4. HELM</a></li>
<li><a href="#orgd6e8b6f">1.5. ACEJUMP</a></li>
<li><a href="#orgc338495">1.6. ACE-WINDOW</a></li>
<li><a href="#org04b3808">1.7. DIRED</a></li>
<li><a href="#org0d4c97f">1.8. MARKDOWN</a></li>
<li><a href="#orga1c4446">1.9. LATEX</a></li>
<li><a href="#orgab77760">1.10. PANDOC</a></li>
<li><a href="#org1430795">1.11. CVS</a></li>
<li><a href="#orga94d3f8">1.12. GIT</a></li>
<li><a href="#org76de459">1.13. HUGO</a></li>
<li><a href="#orgcc571c0">1.14. TWITTER</a></li>
<li><a href="#org26976b2">1.15. SNIPPET</a></li>
<li><a href="#org8a59651">1.16. THEMEN</a></li>
<li><a href="#org75a75ff">1.17. TO SORT</a></li>
</ul>
</li>
</ul>
</div>
</div>


<a id="org6bd5a76"></a>

# EMACS PACKAGES


<a id="org0085824"></a>

## I-SEARCH


<a id="org609be81"></a>

### Keys

-   **Isearch**    | <http://am.informatik.hs-mannheim.de/emacs/Incremental-Search.html#Incremental-Search>
    -   `C-s`    | forward search
    -   `C-s C-r`    | backward search
    -   `C-r`    | to switch to a backward search, leaving the search string unchanged.
    -   `C-g`    | canceling the search
-   **Repeat Isearch**   | <http://am.informatik.hs-mannheim.de/emacs/Repeat-Isearch.html>
    -   `C-s C-s`    | forward serach | invokes incremental + search again
    -   `C-r C-r`    | backward serach | invokes incremental + search again
-   **Reuse earlier search strings** | <http://am.informatik.hs-mannheim.de/emacs/Repeat-Isearch.html#Repeat-Isearch>
    -   `M-p`    | previous
    -   `M-n`    | next
    -   `M-e`    | To edit the current search string in the minibuffer without replacing it with items from the search ring
-   **list-matching-line**   | <http://ergoemacs.org/emacs/elisp_list_matching_lines.html>
    -   `M-o s`    | It'll list all lines in the current file that matches a given text
-   **Modified to**
    -   `C-c b`    | backward search
    -   `C-c f`    | forward serach


<a id="org8439b4a"></a>

## ORG-MOD


<a id="org6fa11e3"></a>

### org


<a id="org3ce4832"></a>

### org-cliplink


<a id="org6f755fa"></a>

### org-autolist


<a id="org5f06efd"></a>

### org-board


<a id="orgf7119c3"></a>

### org-ac


<a id="org88a6bde"></a>

### TOC-org


<a id="orgf6c0fd8"></a>

## EVIL


<a id="org371393e"></a>

### evil-opener


<a id="org8b854b5"></a>

### evil-mark-replace


<a id="org0db8e6e"></a>

### evil-visualstar


<a id="org99393f1"></a>

### evil-textobj-anyblock


<a id="org9c245f7"></a>

### evil-tutor


<a id="orgcdbd1c6"></a>

### evil-args


<a id="orge22f45d"></a>

### evil-magit


<a id="org83f60c8"></a>

## HELM


<a id="orge359d44"></a>

### helm


<a id="org7f4a6f0"></a>

### helm-github-stars


<a id="orgd6e8b6f"></a>

## ACEJUMP


<a id="orge953cba"></a>

### Keys

*AceJump-mode is a minor mode for Emacs, enabling fast/direct cursor movement in current view.* *<https://www.emacswiki.org/emacs/AceJump>*

-   **Serach by Char.**
    -   `C-c j` | Head Char.


<a id="orgcc55334"></a>

### Articles

-   Emacs: ace-Jump, Avy, vs Isearch <http://emacsist.com/10199>
-   Emacs: isearch by Arrow Keys <http://ergoemacs.org/emacs/emacs_isearch_by_arrow_keys.html>


<a id="orgc338495"></a>

## ACE-WINDOW


<a id="orga58e0f1"></a>

### Keys

-   `C-c w` | ace-window


<a id="org04b3808"></a>

## DIRED


<a id="orgabe4aeb"></a>

### dired-toggle-sudo


<a id="orgdf6f491"></a>

### dired-quick-sort


<a id="org0d4c97f"></a>

## MARKDOWN


<a id="orgc8454fa"></a>

### markdown-mode


<a id="orga1c4446"></a>

## LATEX


<a id="orgb03fc9b"></a>

### auctex


<a id="orgab77760"></a>

## PANDOC


<a id="org47899c9"></a>

### pandoc


<a id="org31df8c8"></a>

### pandoc-mode


<a id="org1430795"></a>

## CVS


<a id="orgf728605"></a>

### csv-mode


<a id="orga94d3f8"></a>

## GIT


<a id="org4eeaa4d"></a>

### gited


<a id="orgc363776"></a>

### magit


<a id="org6b18a15"></a>

### gist


<a id="org76de459"></a>

## HUGO


<a id="orgf8f5c00"></a>

### easy-hugo <https://github.com/masasam/emacs-easy-hugo>

*Emacs major mode for writing blogs made with hugo by markdown or org-mode or AsciiDoc or reStructuredText or mmark* 

-   


<a id="orgcc571c0"></a>

## TWITTER


<a id="org8e0899d"></a>

### twittering-mode


<a id="org26976b2"></a>

## SNIPPET


<a id="org9fd83bd"></a>

### yasnippet


<a id="org8a59651"></a>

## THEMEN


<a id="org976478a"></a>

### solarized-theme


<a id="orgf4b91e4"></a>

### airline-themes

---


<a id="org75a75ff"></a>

## TO SORT


<a id="orgf7dd6e2"></a>

### syndicate


<a id="org4e5e3f5"></a>

### scss-mode


<a id="org3037da4"></a>

### undo-tree


<a id="org094e85c"></a>

### neotree


<a id="orga61cf68"></a>

### diffview

